articles = [["30.05.2020", "Золотая молодежь", "Если бы они участвовали в телешоу «Форт Боярд», то без сомнения бы стали победителями. Ведь они в течение долгого времени упорно проходили множество испытаний, а в финале смогли забрать с собой заслуженное золото. Речь не о заядлых искателях сокровищ, а о выпускниках-отличниках из всех муниципальных районов Сурского края, которые по традиции стали участниками ежегодного Бала медалистов. \
            Более 800 выпускников из Пензы и Пензенской области 23 июня стали почетными гостями праздника «Медалист-2021». На Театральной площади собрались ребята, показавшие высшие результаты в учебе, спорте и общественной деятельности. Стремясь к заветной медали, они преодолели многое, не сломила их и аномальная жара в этот праздничный день. \
            Под палящим солнцем медалистов чествовали песнями и стихотворениями. Прозвучали слова напутствия выпускникам и благодарности их родителям и преподавателям. 15 лучших выпускников вместе с родителями были награждены благодарственными письмами губернатора Пензенской области. Врио губернатора Олег Мельниченко поздравил ребят с праздником, пожелав им оставить в памяти и сердце воспоминания о школьных годах. Он отметил, что медали – это награда за их настоящий труд и отличную учебу. С ответными словами выступили выпускники пензенских школ.\
            Закрывая праздник традиционным вальсом, вчерашние школьники провожали свое детство. Незабываемым моментом уходящей юности пензенских выпускников-медалистов стало выступление популярной группы Dabro.\
            Анастасия Кургузова\
            Алексей Карамышев, школа №68:\
            – До 8 класса я учился плохо, но все пошло по нарастающей – к старшей школе у меня получилось добиться успехов в учёбе. Учиться мне было нетрудно, зная, что за мной стоят родители и учителя. Я думаю, что дети всегда идут по стопам своих родителей, поэтому я благодарен им. Учителя тоже играют важную роль. Моим главным мотиватором эти два года была Ольга Петровна Богомолова, учитель из моей школы. Быть медалистом и приятно, и полезно. Медаль даёт дополнительные баллы при поступлении, да и неплохо иметь такую награду. Хорошо, что правительство замечает достижения выдающихся выпускников, проводя этот праздник. Это очень мотивирует.\
            Алина Николаева, школа №68:\
            – Я всегда училась хорошо, это у меня пошло еще с начальной школы, ведь трудностей с учебой у меня не было. Последние два года были, конечно, сложные, но все сложилось удачно, и я оказалась на этом мероприятии. Золотая медаль для меня – это личное достижение, исполнение моей маленькой мечты. Внутри меня всегда был стимул, это для меня многое значит. А этот бал – награда выпускников за их стремление и упорство. К сожалению, все портит очень жаркая погода, но атмосфера замечательная. После торжественной части нас ждало выступление группы Dabro. Это меня очень порадовало, ведь я не знала, что выступят именно они! И это стало сюрпризом, который запомнился больше всего на этом празднике.\
"],
            ["02.06.2020", "Интервью с выпускницей 2020", "Последний звонок, который похож на затянувшийся урок ОБЖ. Визитная карточка выпускников в этом году не нарядная лента, а защитная маска. Каково это — быть онлайн-выпускником? Об этом нам рассказала выпускница пензенской школы№68 Надежда Жукова.\
            — Выпускникам еще в течение долгого времени не верится, что они закончили школу. По привычке рассчитываешь время по школьным звонкам и думаешь, что там вкусненького в столовке сегодня. Обычно на Последнем звонке и понимаешь, что это твое прощание со школой, последняя линейка. Смогла ли ты осознать после такого необычного формата праздника, что школьная пора закончилась?\
            — Лично я осознала, что школьная пора закончилась, ещё в режиме самоизоляции, когда уроки были перенесены в онлайн, и ты, сидя дома, просыпаясь за пять минут до начала, «посещаешь» их. Сегодня этому событию придали торжественности. Именно напутственные слова учителей дали понять, что учеба завершилась. А вот когда дадут аттестат, тогда я точно осознаю, что весь путь пройден.\
            — Трудно ли тебе, твоим одноклассникам было принять, что традиционного, полноценного праздника, к сожалению, не получится?\
            — Конечно, все мы безумно расстроились! В мае у нас всех опустились руки, мы осознали, что все у нас будет по-другому, и многие даже не хотели ни в чем участвовать. Мы разочаровались абсолютно во всем!\
            — Все-таки грустно, что сегодняшним выпускникам не удалось провести последние школьные деньки вместе, ведь любимый всеми День непослушания тоже прошел мимо вас. Как у вас получилось не унывать в такой ситуации?\
            — День Непослушания мы провели по-своему. Пакостили учителям в онлайн режиме: включали музыку во время урока. Я предложила своему классу как-то обозначить этот день в онлайне, сделать флешмоб в Instagram или что-то еще, но все молчали, некоторые вообще говорили, что это безнадежно, забудь и успокойся, но я не могла! В итоге я так завела людей, что у нас с подругами родилась идея для сценария к видео на Последний звонок. Мы его составили, обсудили, предложили классу собраться, чтобы отметить День Непослушания и снять видео, все согласились. Конечно, все соблюдали меры предосторожности. Через день мы встретились, всё сняли, все принимали участие. В итоге у нас получилось очень трогательное и в то же время смешное видео. Работа была проделана не зря, ведь мы единственный класс, который сделал подобное!\
            Школа вышла из чата. Интервью с выпускницей 2020, изображение №2\
            — Администрация вашей школы тоже решила не опускать руки, Последний звонок все же состоялся, пусть и в формате онлайн. Расскажи, как проходила подготовка к этому необычному событию.\
            — За неделю до мероприятия мне сообщили, что я буду ведущей, но попросили держать это в тайне. Ещё не было известно, разрешат ли такой формат проведения звонка, какой был у нас. 27 мая у нас состоялась уже генеральная репетиция, проверка связи, настройка камеры и прочее. Все прошло на высшем уровне! Техника нас почти не подвела, все прошло достаточно быстро и спокойно, опять же, с соблюдением всех мер предосторожности. Ничего не помешало нам сделать этот день праздничным! Единственное, чего не было, это вальса, потому что организовывать репетиции было нельзя.\
            — На ваши плечи свалилась большая ответственность — первые онлайн-ведущие школьной линейки. Не приходилось бегать от блюстителей порядка из-за нарушения режима самоизоляции?\
            — Во время генеральной репетиции вокруг нас собралось много прохожих, всем было интересно. К нам, конечно же, подошёл проходящий мимо полицейский и поинтересовался у руководства, что здесь происходит. Мы объяснили, что у нас есть разрешение и все хорошо, и тогда он ушёл. Именно сегодня таких встреч не было, так как территория школы была закрыта, чтобы никто лишний не попал в эфир.\
            — Все же этот формат проведения праздника новый и необычный даже для современных выпускников, живущих в то время, когда технологии стремительно развиваются. Возникали ли какие-то сложности с подготовкой к мероприятию?\
            — У нас, ведущих, не было никаких трудностей, кроме четкого произношения слов. Единственные сложности, думаю, возникали у руководства, так как собрать в одной конференции в Zoom около 100 человек было очень сложно. Разрешалось впускать только учеников, это строго контролировалось, нужно было все вовремя включать и переключать.\
            — Кажется, что онлайн-линейка лишь отдаленно напоминала настоящую, но может и в этом были какие то плюсы? Как вообще прошло это событие?\
            — Не скажу, что наша линейка была далека от настоящей. Со стороны ведущих ничего не изменилось, кроме маски. Отсутствие людей не смутило, их заменили зеваки, вставшие за забором, а перед собой мы видели камеру и оператора. Все началось как обычно – с фанфар и стихов. Гимн школы и финальная песня также пелись вокалистами вживую. В эфире была демонстрация экрана, где показывали видео-поздравления от родителей, учителей и первоклассников. Также отдельно выводили на экран видео от губернатора, прямую трансляцию от директора и читающих стихотворения старшеклассников.\
            — Остались два последних штриха, с помощью которых выпускники завершат картину своих школьных лет – ЕГЭ и выпускной. Как считаешь, эти события обойдут нынешних одиннадцатиклассников стороной?\
            — Как уже стало известно – ЕГЭ состоится в июле. Честно говоря, я отнеслась спокойно к переносу дат, так как есть возможность ещё подготовиться, да и не вижу смысла торопиться. А вот мои друзья недовольны этим, ведь все лето уйдёт на экзамены, совсем не останется времени на отдых. Ещё плюс июльская жара в аудитории. Про выпускной вечер пока нет точной информации, но ходят слухи, что он все-таки состоится. Мы искренне в это верим! Некоторые уже давно купили себе дорогие наряды, и им не терпится выйти в них в свет! В конце концов, выпускной – это именно то, ради чего большинство старшеклассников идёт в 11 класс. Безумно обидно будет остаться без этого красивого праздника. Мы и так запомнимся всем, войдём в историю, но хотелось бы завершить это все самым крутым выпускным вечером."]]



let count = 1;

function create() {
    count = count + 1;

    let article = [];
    let dt = prompt("Введите сегодняшнюю дату");
    let hp = prompt("Введите заголовок статьи");
    let text = prompt("Введите содержимое статьи");
    
    article.push(dt);
    article.push(hp);
    article.push(text);
    
    articles.push(article);
    
    const parent_elem = document.querySelector('.menu');
    let new_button = document.createElement('button');
    new_button.innerText = articles[count][0];
    new_button.setAttribute("onclick", `article_header.innerHTML = articles[${count}][1]; article_content.innerHTML = articles[${count}][2]`);
    parent_elem.append(new_button);

    console.log(articles);
    }

// function fillArticle() {
//     const article_header = document.querySelector('#hp');
//     const article_content = document.querySelector('#paragraph');

//     // article_header.innerHTML = articles[][1];
// }

const article_one = document.querySelector('.article1');
article_one.innerHTML = articles[0][0];
const article_two = document.querySelector('.article2');
article_two.innerHTML = articles[1][0];

const article_header = document.querySelector('#hp');
const article_content = document.querySelector('#paragraph');

const create_button = document.querySelector('.create');
create_button.addEventListener('click', create);



// document.addEventListener('click', ({ target: t }) => {
//     if (t.tagName === 'BUTTON') {
//       console.log(t.closest('div')?.id);
//     }
//   });